2.2.013/src/Catalogs/МК_ЗаявкиНаОтсутствие/МК_ЗаявкиНаОтсутствие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ЗаявкиНаОтсутствие</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОтсутствия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолвоДнейОтсутствия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.МК_СтатусыЗаявокНаОтсутствия</types>
    </type>
  </attributes>
  <attributes>
    <name>КолвоЧасовОтсутствия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Целосменный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ1С</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента1С</name>
    <type>
      <types>CatalogRef.МК_СоответствиеОтсутствий</types>
    </type>
  </attributes>
  <attributes>
    <name>IDДокументаМК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияОтсутствия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Групповая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияВ1С</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/InformationRegisters/МК_МоиЗадания/МК_МоиЗадания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МК_МоиЗадания</name>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ВидОтсутствия</name>
    <type>
      <types>CatalogRef.МК_СоответствиеОтсутствий</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Целосменный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КолвоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КолвоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>CatalogRef.МК_ЗаявкиНаОтсутствие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

2.2.013/src/Enums/МК_СтатусыЗаявокНаОтсутствия/МК_СтатусыЗаявокНаОтсутствия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_СтатусыЗаявокНаОтсутствия</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Необработана</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Catalogs/МК_СоответствиеОтсутствий/МК_СоответствиеОтсутствий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_СоответствиеОтсутствий</name>
  <predefined>
    <items>
      <name>БольничныйЛист</name>
      <description>Больничный лист</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>Командировка</description>
    </items>
    <items>
      <name>ОплатаДнейУходаЗаДетьмиИнвалидами</name>
      <description>Оплата дней ухода за детьми инвалидами</description>
    </items>
    <items>
      <name>Отгул</name>
      <description>Отгул</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>Отпуск по беременности и родам</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенком</name>
      <description>Отпуск по уходу за ребенком</description>
    </items>
    <items>
      <name>ПрогулНеявка</name>
      <description>Прогул, неявка</description>
    </items>
  </predefined>
  <attributes>
    <name>КодИзМК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объект1С</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ВидыОтпусков</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выгружать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Целосменный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.МК_РолиИсполнителей</types>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/Catalogs/МК_РолиИсполнителей/МК_РолиИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_РолиИсполнителей</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

2.2.013/src/Catalogs/МК_ЗаявкиНаОтсутствие/ManagerModule.bsl
&НаСервере
Функция ПолучитьИОбработатьЗаявкиИзМК()      Экспорт
	мСписок = ЗапросЗаявокИзМК().items;    
	мСписокКОтправке = Новый Массив;          
	мСписокСсылок = Новый Массив;
	Для Каждого мЭлемент Из мСписок Цикл
		// Первая задача - разобрать мЭлемент по реквизитам, каждый - определить в 1С и если все хорошо, записать событие в 
		// справочник МК_ЗаявкиНаОтсутствие
		мСсылка = РазобратьЗаявку(мЭлемент); 
		Если Не мСсылка = Неопределено Тогда  
			мСписокСсылок.Добавить(мСсылка);
			мСписокКОтправке.Добавить(мСсылка.IDДокументаМК);
		КонецЕсли;	
	КонецЦикла;	
	Если мСписокКОтправке.Количество() > 0 Тогда
		ОтправитьСписокЗаявок(мСписокКОтправке);
		ОтразитьВРегистре(мСписокСсылок);
	КонецЕсли;	
КонецФункции	

&НаСервере
Функция ЗапросЗаявокИзМК()                   
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина); 
	мВозврат = Новый Массив; 
	//мТело = Новый Структура;       	
	//мТело.Вставить("Ids",мСписДок);
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 		
		//ЗаписьJSON = Новый ЗаписьJSON;
		//ЗаписьJSON.УстановитьСтроку();
	    //ЗаписатьJSON(ЗаписьJSON, мТело);	
		//ТекстJSON = ЗаписьJSON.Закрыть();   	
		 
		hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/absence-requests/pull", мСеанс);    
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
		//hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			//Если ТипЗнч(СтрОтвет) <> Тип("Структура") ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
			//	// Тут какая-то беда. Или структура не получена, или она неправильная  
			//Иначе     
			//	мВозврат = СтрОтвет.Data.Items;	
			//КонецЕсли;	
			мВозврат = СтрОтвет;
		Исключение   
			мОшибка = "Ошибка получения заявок. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  
			Сообщить(мОшибка);
		КонецПопытки; 						
	КонецЕсли;	
	Возврат мВозврат;
КонецФункции

Функция РазобратьЗаявку(мЭлемент) 
	// Что должно быть в заявке.
	// external_id     + - Код из МК
	// user_id         + - ID сотрудника 
	// company         + - ID организации 
	// is_full         + - целосменный?
	// date_doc        + - дата подачи заявки
	// absence_type_id + - код вида отсутствия в МК 
	// comment         + - комментарий
	// date_from       + - дата начала отсутствия
	// date_to         + - дата завершения отсутствия
	// value           + - значение (дни или часы)     
	// Возвращаем: если все нормально определилось - IDДокументаМК, иначе- Неопределено. 
	мВозврат = Неопределено;
	мОшибка = Ложь;
	мСтрока = Новый Структура("Сотрудник, Организация, МК_КодВидаОтсутствия, ДатаДокумента, 
				              | ДатаНачалаОтсутствия,КолвоДнейОтсутствия, Комментарий,	ДатаЗавершенияОтсутствия,					
							  | Целосменный, ВидДокумента1С, КолвоЧасовОтсутствия, IDДокументаМК, Групповая");
	Если мЭлемент.Свойство("user_id") Тогда   
		Если Не (мЭлемент.user_id = Неопределено) Тогда
			мСтрока.Сотрудник = НайтиСотрудника(мЭлемент.user_id);   
			Если мСтрока.Сотрудник = Справочники.Сотрудники.ПустаяСсылка() ИЛИ СтрНайти(мСтрока.Сотрудник, "Объект не найден") > 0 Тогда
				мОшибка = Истина;
			КонецЕсли
		Иначе	
			мОшибка = Истина;
		КонецЕсли;		
	Иначе          
		мОшибка = Истина;
	КонецЕсли;	                                              
	Если мОшибка = Ложь И мЭлемент.Свойство("company") Тогда
		//Если Не (мЭлемент.company = Неопределено) Тогда
			//мСтрока.Организация = НайтиОрганизацию(мЭлемент.company);   
			//Если мСтрока.Организация = Справочники.Организации.ПустаяСсылка() Тогда
			//	мОшибка = Истина;
			//КонецЕсли;
		//Иначе	                 
		//	мОшибка = Истина;
		//КонецЕсли;
		мСтрока.Организация = мСтрока.Сотрудник.ГоловнаяОрганизация;  // Пока не смотрим на организацию из МК.
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	                                            
	Если мОшибка = Ложь И мЭлемент.Свойство("ext_id") Тогда
		мСтрока.IDДокументаМК = мЭлемент.ext_id; 
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	 
	Если мОшибка = Ложь И мЭлемент.Свойство("is_full") Тогда
		мСтрока.Целосменный = мЭлемент.is_full;
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	                               
	Если мОшибка = Ложь И мЭлемент.Свойство("date_doc") Тогда
		мСтрока.ДатаДокумента = мДата(мЭлемент.date_doc);
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	                                             
	Если мОшибка = Ложь И мЭлемент.Свойство("absence_type_id") Тогда
		мСтрока.МК_КодВидаОтсутствия = мЭлемент.absence_type_id; 
		// Надо определить вид отсутствия в 1С
		мКод1С = Справочники.МК_СоответствиеОтсутствий.НайтиДокумент1С(мСтрока.МК_КодВидаОтсутствия);
		Если мКод1С = Неопределено Тогда
			мОшибка = Истина;       
		Иначе
			мСтрока.ВидДокумента1С = мКод1С;
		КонецЕсли;	
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	                    
	Если мОшибка = Ложь И мЭлемент.Свойство("comment") Тогда
		мСтрока.Комментарий = мЭлемент.comment;
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	                    
    Если мОшибка = Ложь И мЭлемент.Свойство("date_from") Тогда
		мСтрока.ДатаНачалаОтсутствия = мДата(мЭлемент.date_from);
	Иначе                
		мОшибка = Истина;
	КонецЕсли;	   
	Если мОшибка = Ложь И мЭлемент.Свойство("date_to") Тогда
		мСтрока.ДатаЗавершенияОтсутствия = мДата(мЭлемент.date_to);
	Иначе                
		мОшибка = Истина;
	КонецЕсли;      
	Если мОшибка = Ложь И мЭлемент.Свойство("is_group") Тогда
		мСтрока.Групповая = мЭлемент.is_group;
	Иначе                
		мОшибка = Истина;
	КонецЕсли;

                                                   
	Если мОшибка = Ложь И мЭлемент.Свойство("value") Тогда
		Если мСтрока.Целосменный Тогда 
			мСтрока.КолвоДнейОтсутствия = мЭлемент.value;
		Иначе
			мСтрока.КолвоЧасовОтсутствия = мЭлемент.value;
		КонецЕсли;		        
	Иначе                
		мОшибка = Истина;		
	КонецЕсли;	    
	Если мОшибка = Ложь  Тогда    // Все определилось хорошо
		// Теперь - записать заявку в справочник.
		мСсылка = ЗаписатьЗаявку(мСтрока);  // Может быть какая-то беда с тем, что заявка уже есть в базе.
		Если Не мСсылка = Неопределено Тогда
			//мВозврат = мСтрока.IDДокументаМК;
			мВозврат = мСсылка;
		КонецЕсли;	  	
	КонецЕсли;	
	Возврат мВозврат;
КонецФункции	          

Функция НайтиСотрудника(мID)  
	мСотрСсылка = Справочники.Сотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(мID)); 
	Возврат мСотрСсылка;	
КонецФункции	

Функция НайтиОрганизацию(мID)                                                                
	мОргСсылка = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(мID)); 
	Возврат мОргСсылка;	                                                                 
КонецФункции	                                                        
                                        
Функция ЗаписатьЗаявку(мЗаявка)   
	мРез = Неопределено;
	//мСсылка = Справочники.МК_ЗаявкиНаОтсутствие.НайтиПоНаименованию(мЗаявка.IDДокументаМК);     
	мСсылка = Справочники.МК_ЗаявкиНаОтсутствие.НайтиПоРеквизиту("IDДокументаМК",мЗаявка.IDДокументаМК);     
	Если мСсылка.Пустая() или мСсылка.ПометкаУдаления = Истина ИЛИ мЗаявка.Групповая Тогда   //  Не нашли, можно добавлять
		НовыйЭлемент = Справочники.МК_ЗаявкиНаОтсутствие.СоздатьЭлемент(); 
		НовыйЭлемент.Наименование = мЗаявка.МК_КодВидаОтсутствия;  
		НовыйЭлемент.Сотрудник = мЗаявка.Сотрудник;  
		НовыйЭлемент.Организация = мЗаявка.Организация;  
		НовыйЭлемент.ДатаДокумента = мЗаявка.ДатаДокумента;  
		НовыйЭлемент.ДатаНачалаОтсутствия = мЗаявка.ДатаНачалаОтсутствия;  
		НовыйЭлемент.КолвоДнейОтсутствия = мЗаявка.КолвоДнейОтсутствия;  
		НовыйЭлемент.Комментарий = мЗаявка.Комментарий; 
		НовыйЭлемент.КолвоЧасовОтсутствия= мЗаявка.КолвоЧасовОтсутствия; 
		НовыйЭлемент.Целосменный = мЗаявка.Целосменный; 
		НовыйЭлемент.ВидДокумента1С = мЗаявка.ВидДокумента1С; 
		НовыйЭлемент.IDДокументаМК = мЗаявка.IDДокументаМК; 
		НовыйЭлемент.ДатаЗавершенияОтсутствия = мЗаявка.ДатаЗавершенияОтсутствия;  	
		НовыйЭлемент.СтатусЗаявки = Перечисления.МК_СтатусыЗаявокНаОтсутствия.Необработана;     		
		НовыйЭлемент.Групповая = мЗаявка.Групповая;   
		НовыйЭлемент.ДатаПолученияВ1С = ТекущаяДата();
		Попытка
			НовыйЭлемент.Записать();  
			мРез = НовыйЭлемент.Ссылка;
		Исключение    		
			//мРез = Ложь;
		КонецПопытки;	
	Иначе
	КонецЕсли;	                
	Возврат мРез;
КонецФункции	

&НаСервере
Функция ОтправитьСписокЗаявок(мСписок)                      
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина); 
	//мВозврат = Новый Массив; 
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.
	Иначе         
		мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 
		
		мВыгрузка = Новый Структура;  
		мВыгрузка.Вставить("Absences_ids",мСписок);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
	    ЗаписатьJSON(ЗаписьJSON, мВыгрузка);	
		ТекстJSON = ЗаписьJSON.Закрыть();   	  	                                          
		hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/absence-requests/mark-exported", мСеанс);    
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
		hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			//Если ТипЗнч(СтрОтвет) <> Тип("Структура") ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
			//	// Тут какая-то беда. Или структура не получена, или она неправильная  
			//Иначе     
			//	мВозврат = СтрОтвет.Data.Items;	
			//КонецЕсли;	
			мВозврат = СтрОтвет;
		Исключение   
			мОшибка = "Ошибка получения справочника. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  
			Сообщить(мОшибка);
		КонецПопытки; 						
	КонецЕсли;	
	Возврат мВозврат;
КонецФункции

Функция мДата(мСтрока)    
	мСтр = СтроковыеФункцииКлиентСервер.СтрокаВДату(мСтрока, "ДФ='Д.М.Г'");
	// Сюда приходит строка типа 2025-07-15ххххх, где xxxx - какие-то ненужные символы. Надо отсечь ненужное, и тирешки удалить. Потом - в дату
	//мСтр = Сред(мСтрока,1,10);
	//мСтр = СтрЗаменить(мСтр,"-","");
	Возврат Дата(мСтр);
КонецФункции	

Функция ОтразитьВРегистре(мСписок)    Экспорт 
	// Тут для каждой ссылки нужно найти пользователей, которым будет назначена заявка
	Для Каждого мЗаявка Из мСписок Цикл 
		мПользователи = Новый Массив;
		мРоль = Неопределено;   
		Если мЗаявка.ВидЗаявки = 0 Тогда   // Отсутствия
		// Пользователей подбираем по роли и организации. Сначала - Роль
			мВидОтсутствия = Справочники.МК_СоответствиеОтсутствий.НайтиПоРеквизиту("КодИзМК", мЗаявка.Наименование);
			Если не мВидОтсутствия = Неопределено Тогда
				мРоль = мВидОтсутствия.Роль;
				мПользователи = Справочники.МК_РолиИсполнителей.ПолучитьПользователей(мРоль, мЗаявка.Организация);   
				Для Каждого мПользователь Из мПользователи Цикл
					СоздатьЗаявку(мЗаявка, мПользователь);
				КонецЦикла;	
				
			КонецЕсли;	
		ИначеЕсли мЗаявка.ВидЗаявки = 1 Тогда   // Создание сотрудника
			мВид = Справочники.МК_СоответствиеОтсутствий.НайтиПоРеквизиту("КодИзМК", "СозданиеСотрудника");
			мРоль = мВид.Роль;
			мПользователи = Справочники.МК_РолиИсполнителей.ПолучитьПользователей(мРоль, мЗаявка.Организация);   
			Для Каждого мПользователь Из мПользователи Цикл
				СоздатьЗаявку(мЗаявка, мПользователь);
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;	
КонецФункции	 

Функция СоздатьЗаявку(мЗаявка, мПользователь)
	мЗапись = РегистрыСведений.МК_МоиЗадания.СоздатьМенеджерЗаписи(); 
	мЗапись.ВидЗаявки = мЗаявка.ВидЗаявки;
	мЗапись.Заявка = мЗаявка;
	мЗапись.Пользователь = мПользователь;
	мЗапись.ВидОтсутствия = мЗаявка.ВидДокумента1С;  
	мЗапись.ДатаНачала = мЗаявка.ДатаНачалаОтсутствия;     
	мЗапись.Целосменный = мЗаявка.Целосменный;
	мЗапись.Сотрудник = мЗаявка.Сотрудник;
	мЗапись.Организация = мЗаявка.Организация; 
	мЗапись.КолвоДней = мЗаявка.КолвоДнейОтсутствия;
	мЗапись.КолвоЧасов = мЗаявка.КолвоЧасовОтсутствия;  
	мЗапись.ДатаЗавершения = мЗаявка.ДатаЗавершенияОтсутствия;    
	мЗапись.Фамилия = мЗаявка.Фамилия;
	мЗапись.Имя = мЗаявка.Имя;
	мЗапись.Отчество = мЗаявка.Отчество;  	
	мЗапись.Записать();
КонецФункции
